13/data/attachments/2360282dfc685514.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_a5ed8966-d45f-46e8-afb3-5282e6c133f4</nif:username>
            <nif:friendToBeAdded>Shane_despite_Actions_14723_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>